; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=315, out_folder=./training, instance_id=65, seed=2089, goal_proportion=0.03

(define (problem blocksworld-65)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 - object)
 (:init 
    (arm-empty)
    (clear b138)
    (on b138 b81)
    (on b81 b274)
    (on b274 b134)
    (on b134 b16)
    (on b16 b117)
    (on b117 b244)
    (on b244 b304)
    (on b304 b82)
    (on b82 b206)
    (on b206 b189)
    (on b189 b143)
    (on-table b143)
    (clear b283)
    (on b283 b295)
    (on b295 b56)
    (on b56 b120)
    (on b120 b200)
    (on b200 b107)
    (on-table b107)
    (clear b4)
    (on b4 b166)
    (on b166 b281)
    (on b281 b124)
    (on b124 b185)
    (on b185 b12)
    (on b12 b312)
    (on b312 b87)
    (on b87 b298)
    (on b298 b136)
    (on-table b136)
    (clear b223)
    (on-table b223)
    (clear b37)
    (on b37 b98)
    (on b98 b179)
    (on b179 b227)
    (on b227 b187)
    (on-table b187)
    (clear b83)
    (on-table b83)
    (clear b310)
    (on b310 b39)
    (on b39 b276)
    (on b276 b204)
    (on b204 b178)
    (on b178 b128)
    (on b128 b205)
    (on b205 b118)
    (on b118 b129)
    (on b129 b194)
    (on b194 b264)
    (on-table b264)
    (clear b217)
    (on b217 b265)
    (on b265 b222)
    (on b222 b96)
    (on b96 b53)
    (on b53 b112)
    (on-table b112)
    (clear b238)
    (on b238 b43)
    (on b43 b153)
    (on-table b153)
    (clear b142)
    (on-table b142)
    (clear b292)
    (on b292 b288)
    (on b288 b44)
    (on b44 b135)
    (on-table b135)
    (clear b11)
    (on b11 b158)
    (on b158 b8)
    (on b8 b29)
    (on b29 b271)
    (on b271 b309)
    (on b309 b24)
    (on-table b24)
    (clear b69)
    (on b69 b26)
    (on b26 b167)
    (on-table b167)
    (clear b170)
    (on b170 b199)
    (on-table b199)
    (clear b291)
    (on b291 b203)
    (on b203 b141)
    (on b141 b137)
    (on-table b137)
    (clear b72)
    (on b72 b165)
    (on b165 b246)
    (on b246 b279)
    (on b279 b51)
    (on b51 b173)
    (on-table b173)
    (clear b78)
    (on-table b78)
    (clear b89)
    (on b89 b290)
    (on b290 b88)
    (on b88 b161)
    (on b161 b182)
    (on b182 b102)
    (on-table b102)
    (clear b64)
    (on-table b64)
    (clear b174)
    (on-table b174)
    (clear b195)
    (on b195 b74)
    (on-table b74)
    (clear b13)
    (on b13 b60)
    (on b60 b201)
    (on b201 b251)
    (on b251 b250)
    (on b250 b91)
    (on-table b91)
    (clear b191)
    (on b191 b122)
    (on b122 b305)
    (on-table b305)
    (clear b45)
    (on-table b45)
    (clear b171)
    (on b171 b31)
    (on b31 b218)
    (on b218 b311)
    (on b311 b32)
    (on b32 b67)
    (on-table b67)
    (clear b157)
    (on-table b157)
    (clear b145)
    (on b145 b261)
    (on b261 b92)
    (on-table b92)
    (clear b125)
    (on b125 b27)
    (on b27 b94)
    (on-table b94)
    (clear b258)
    (on b258 b255)
    (on-table b255)
    (clear b169)
    (on b169 b99)
    (on b99 b3)
    (on b3 b84)
    (on b84 b14)
    (on-table b14)
    (clear b160)
    (on-table b160)
    (clear b247)
    (on b247 b163)
    (on b163 b15)
    (on b15 b257)
    (on b257 b267)
    (on-table b267)
    (clear b103)
    (on b103 b193)
    (on-table b193)
    (clear b36)
    (on b36 b19)
    (on b19 b215)
    (on b215 b275)
    (on-table b275)
    (clear b236)
    (on b236 b17)
    (on b17 b214)
    (on b214 b226)
    (on b226 b147)
    (on b147 b299)
    (on b299 b216)
    (on b216 b97)
    (on-table b97)
    (clear b259)
    (on b259 b254)
    (on b254 b75)
    (on b75 b300)
    (on b300 b132)
    (on b132 b108)
    (on b108 b57)
    (on b57 b253)
    (on b253 b121)
    (on b121 b228)
    (on b228 b296)
    (on b296 b293)
    (on b293 b220)
    (on b220 b22)
    (on b22 b49)
    (on b49 b140)
    (on b140 b308)
    (on b308 b66)
    (on b66 b209)
    (on b209 b111)
    (on b111 b52)
    (on-table b52)
    (clear b105)
    (on b105 b268)
    (on b268 b48)
    (on b48 b6)
    (on b6 b85)
    (on b85 b232)
    (on b232 b10)
    (on-table b10)
    (clear b133)
    (on-table b133)
    (clear b148)
    (on-table b148)
    (clear b266)
    (on b266 b162)
    (on b162 b35)
    (on b35 b119)
    (on b119 b208)
    (on b208 b306)
    (on b306 b197)
    (on b197 b234)
    (on b234 b126)
    (on b126 b155)
    (on-table b155)
    (clear b183)
    (on b183 b307)
    (on b307 b139)
    (on b139 b225)
    (on-table b225)
    (clear b30)
    (on b30 b95)
    (on b95 b130)
    (on b130 b58)
    (on b58 b212)
    (on b212 b110)
    (on b110 b284)
    (on b284 b221)
    (on b221 b55)
    (on b55 b202)
    (on b202 b79)
    (on b79 b175)
    (on b175 b269)
    (on b269 b123)
    (on b123 b186)
    (on b186 b149)
    (on b149 b231)
    (on-table b231)
    (clear b106)
    (on-table b106)
    (clear b230)
    (on b230 b282)
    (on b282 b272)
    (on b272 b280)
    (on b280 b20)
    (on b20 b73)
    (on b73 b239)
    (on b239 b249)
    (on-table b249)
    (clear b21)
    (on-table b21)
    (clear b127)
    (on b127 b248)
    (on-table b248)
    (clear b172)
    (on b172 b277)
    (on b277 b235)
    (on-table b235)
    (clear b315)
    (on b315 b2)
    (on b2 b243)
    (on b243 b93)
    (on b93 b262)
    (on b262 b151)
    (on-table b151)
    (clear b301)
    (on b301 b233)
    (on b233 b7)
    (on-table b7)
    (clear b302)
    (on b302 b25)
    (on b25 b240)
    (on b240 b114)
    (on b114 b1)
    (on-table b1)
    (clear b46)
    (on b46 b131)
    (on b131 b177)
    (on b177 b23)
    (on-table b23)
    (clear b188)
    (on b188 b256)
    (on b256 b5)
    (on b5 b113)
    (on b113 b152)
    (on b152 b80)
    (on b80 b71)
    (on b71 b313)
    (on-table b313)
    (clear b101)
    (on b101 b34)
    (on b34 b42)
    (on-table b42)
    (clear b18)
    (on b18 b154)
    (on b154 b245)
    (on b245 b61)
    (on b61 b286)
    (on b286 b150)
    (on b150 b156)
    (on-table b156)
    (clear b159)
    (on b159 b252)
    (on b252 b192)
    (on b192 b219)
    (on-table b219)
    (clear b115)
    (on b115 b273)
    (on b273 b184)
    (on b184 b47)
    (on b47 b241)
    (on b241 b104)
    (on b104 b260)
    (on b260 b38)
    (on b38 b146)
    (on b146 b59)
    (on b59 b285)
    (on b285 b164)
    (on-table b164)
    (clear b263)
    (on b263 b50)
    (on b50 b168)
    (on b168 b207)
    (on b207 b40)
    (on-table b40)
    (clear b242)
    (on-table b242)
    (clear b297)
    (on b297 b190)
    (on b190 b28)
    (on b28 b9)
    (on b9 b210)
    (on b210 b176)
    (on b176 b77)
    (on b77 b116)
    (on b116 b65)
    (on b65 b54)
    (on b54 b86)
    (on b86 b213)
    (on b213 b224)
    (on-table b224)
    (clear b68)
    (on b68 b198)
    (on b198 b229)
    (on b229 b287)
    (on b287 b70)
    (on b70 b294)
    (on b294 b180)
    (on b180 b109)
    (on b109 b41)
    (on-table b41)
    (clear b237)
    (on b237 b76)
    (on b76 b100)
    (on b100 b303)
    (on b303 b211)
    (on b211 b144)
    (on-table b144)
    (clear b33)
    (on b33 b314)
    (on b314 b181)
    (on b181 b278)
    (on-table b278)
    (clear b289)
    (on b289 b63)
    (on b63 b90)
    (on-table b90)
    (clear b270)
    (on b270 b62)
    (on b62 b196)
    (on-table b196))
 (:goal  (and 
    (clear b6)
    (on b6 b7)
    (on b7 b3)
    (on b3 b2)
    (on b2 b5)
    (on b5 b9)
    (on-table b9)
    (clear b4)
    (on b4 b1)
    (on b1 b8)
    (on-table b8))))

; plan
1. (unstack b105 b268)
   deleted: (on b105 b268) (clear b105) (arm-empty)
   added: (holding b105) (clear b268)
   goals met: 1 of 11
2. (putdown b105)
   deleted: (holding b105)
   added: (clear b105) (arm-empty) (on-table b105)
   goals met: 1 of 11
3. (unstack b11 b158)
   deleted: (on b11 b158) (clear b11) (arm-empty)
   added: (holding b11) (clear b158)
   goals met: 1 of 11
4. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 11
5. (unstack b158 b8)
   deleted: (on b158 b8) (clear b158) (arm-empty)
   added: (holding b158) (clear b8)
   goals met: 1 of 11
6. (putdown b158)
   deleted: (holding b158)
   added: (clear b158) (arm-empty) (on-table b158)
   goals met: 1 of 11
7. (unstack b8 b29)
   deleted: (on b8 b29) (clear b8) (arm-empty)
   added: (holding b8) (clear b29)
   goals met: 1 of 11
8. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 11
9. (unstack b169 b99)
   deleted: (on b169 b99) (clear b169) (arm-empty)
   added: (holding b169) (clear b99)
   goals met: 2 of 11
10. (putdown b169)
   deleted: (holding b169)
   added: (clear b169) (arm-empty) (on-table b169)
   goals met: 2 of 11
11. (unstack b188 b256)
   deleted: (on b188 b256) (clear b188) (arm-empty)
   added: (holding b188) (clear b256)
   goals met: 2 of 11
12. (putdown b188)
   deleted: (holding b188)
   added: (clear b188) (arm-empty) (on-table b188)
   goals met: 2 of 11
13. (unstack b256 b5)
   deleted: (on b256 b5) (clear b256) (arm-empty)
   added: (holding b256) (clear b5)
   goals met: 2 of 11
14. (putdown b256)
   deleted: (holding b256)
   added: (clear b256) (arm-empty) (on-table b256)
   goals met: 2 of 11
15. (unstack b268 b48)
   deleted: (on b268 b48) (clear b268) (arm-empty)
   added: (holding b268) (clear b48)
   goals met: 2 of 11
16. (putdown b268)
   deleted: (holding b268)
   added: (clear b268) (arm-empty) (on-table b268)
   goals met: 2 of 11
17. (unstack b297 b190)
   deleted: (on b297 b190) (clear b297) (arm-empty)
   added: (holding b297) (clear b190)
   goals met: 2 of 11
18. (putdown b297)
   deleted: (holding b297)
   added: (clear b297) (arm-empty) (on-table b297)
   goals met: 2 of 11
19. (unstack b190 b28)
   deleted: (on b190 b28) (clear b190) (arm-empty)
   added: (holding b190) (clear b28)
   goals met: 2 of 11
20. (putdown b190)
   deleted: (holding b190)
   added: (clear b190) (arm-empty) (on-table b190)
   goals met: 2 of 11
21. (unstack b28 b9)
   deleted: (on b28 b9) (clear b28) (arm-empty)
   added: (holding b28) (clear b9)
   goals met: 2 of 11
22. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 2 of 11
23. (unstack b9 b210)
   deleted: (on b9 b210) (clear b9) (arm-empty)
   added: (holding b9) (clear b210)
   goals met: 2 of 11
24. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 3 of 11
25. (unstack b301 b233)
   deleted: (on b301 b233) (clear b301) (arm-empty)
   added: (holding b301) (clear b233)
   goals met: 3 of 11
26. (putdown b301)
   deleted: (holding b301)
   added: (clear b301) (arm-empty) (on-table b301)
   goals met: 3 of 11
27. (unstack b233 b7)
   deleted: (on b233 b7) (clear b233) (arm-empty)
   added: (holding b233) (clear b7)
   goals met: 3 of 11
28. (putdown b233)
   deleted: (holding b233)
   added: (clear b233) (arm-empty) (on-table b233)
   goals met: 3 of 11
29. (unstack b302 b25)
   deleted: (on b302 b25) (clear b302) (arm-empty)
   added: (holding b302) (clear b25)
   goals met: 3 of 11
30. (putdown b302)
   deleted: (holding b302)
   added: (clear b302) (arm-empty) (on-table b302)
   goals met: 3 of 11
31. (unstack b25 b240)
   deleted: (on b25 b240) (clear b25) (arm-empty)
   added: (holding b25) (clear b240)
   goals met: 3 of 11
32. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 3 of 11
33. (unstack b240 b114)
   deleted: (on b240 b114) (clear b240) (arm-empty)
   added: (holding b240) (clear b114)
   goals met: 3 of 11
34. (putdown b240)
   deleted: (holding b240)
   added: (clear b240) (arm-empty) (on-table b240)
   goals met: 3 of 11
35. (unstack b114 b1)
   deleted: (on b114 b1) (clear b114) (arm-empty)
   added: (holding b114) (clear b1)
   goals met: 3 of 11
36. (putdown b114)
   deleted: (holding b114)
   added: (clear b114) (arm-empty) (on-table b114)
   goals met: 3 of 11
37. (unstack b315 b2)
   deleted: (on b315 b2) (clear b315) (arm-empty)
   added: (holding b315) (clear b2)
   goals met: 3 of 11
38. (putdown b315)
   deleted: (holding b315)
   added: (clear b315) (arm-empty) (on-table b315)
   goals met: 3 of 11
39. (unstack b48 b6)
   deleted: (on b48 b6) (clear b48) (arm-empty)
   added: (holding b48) (clear b6)
   goals met: 4 of 11
40. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 4 of 11
41. (unstack b99 b3)
   deleted: (on b99 b3) (clear b99) (arm-empty)
   added: (holding b99) (clear b3)
   goals met: 4 of 11
42. (putdown b99)
   deleted: (holding b99)
   added: (clear b99) (arm-empty) (on-table b99)
   goals met: 4 of 11
43. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 4 of 11
44. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 5 of 11
45. (unstack b5 b113)
   deleted: (on b5 b113) (clear b5) (arm-empty)
   added: (holding b5) (clear b113)
   goals met: 5 of 11
46. (stack b5 b9)
   deleted: (clear b9) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b9)
   goals met: 6 of 11
47. (unstack b2 b243)
   deleted: (on b2 b243) (clear b2) (arm-empty)
   added: (holding b2) (clear b243)
   goals met: 6 of 11
48. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 7 of 11
49. (unstack b3 b84)
   deleted: (on b3 b84) (clear b3) (arm-empty)
   added: (holding b3) (clear b84)
   goals met: 7 of 11
50. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 8 of 11
51. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 8 of 11
52. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 9 of 11
53. (unstack b4 b166)
   deleted: (on b4 b166) (clear b4) (arm-empty)
   added: (holding b4) (clear b166)
   goals met: 8 of 11
54. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 10 of 11
55. (unstack b6 b85)
   deleted: (on b6 b85) (clear b6) (arm-empty)
   added: (holding b6) (clear b85)
   goals met: 9 of 11
56. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 11 of 11
